{
  "recipes": [
    {
      "id": "1",
      "title": "Brined Fries",
      "ingredients": [
        "2 large russet potatoes",
        "35g kosher salt",
        "750g water",
        "1 clove garlic, lightly crushed",
        "¼ teaspoon (1g) brown mustard seed",
        "½ teaspoon (2g) black peppercorn"
      ],
      "method": "1. Peel the potatoes and cut them into ¼ inch planks. Cut the planks vertically into ¼ inch sticks. Optionally, rinse the cut potatoes in cold water, then pat fries using paper towels until as dry as possible. 2. In a quart sized mason jar, add water and salt. Whisk until the salt is fully dissolved. Add garlic, mustard seed, and peppercorn, followed by the cut potatoes, ensuring they’re fully submerged in the brine.  Place a lid onto the jar, making sure air can escape, and let sit at room temperature for 3-5 days. If for some reason this causes the jar to overflow you may need to switch to a larger container and add additional brine to cover. To do that simply make a second batch of brine and continue adding until the potato is submerged. 3. Fill a 6 quart Dutch oven or heavy bottomed pot with vegetable oil and heat to 320°F (160°C).  While the oil is heating, drain the potatoes from the brine and pat dry using a paper towel. 4. Fry the potatoes for 1-2 minutes, or until the fries turn pale in color and matte on the exterior.  Transfer to a paper towel lined baking tray and pat dry of excess oil. Bring oil to 350°F (176°C) over medium high heat.  5. Fry potatoes once more for 2-3 minutes, or until the fries are a deep golden color and crispy. Using a spider, remove the fries and allow a moment to drain off excess oil before adding to a large mixing bowl and immediately seasoning to taste with salt.   Toss while seasoning to get an even coating.  Serve hot with dipping sauces of choice.",
      "cookingTime": "5 minutes"
    },
    {
      "id": "2",
      "title": "Fettuccine al Burro",
      "ingredients": [
        "14 oz 400g pasta Fettuccine ",
        "1/2 cup (115g) unsalted butter, softened",
        "2 cups 250g grated parmigiano reggiano",
        "Salt and pepper to taste"
      ],
      "method": "1. Place fettuccine in a pot of boiling water that’s been seasoned generously. 2. In a large bowl, add softened unsalted butter and season with pepper. 3. Reserve ¾ cup of pasta water. Drain the pasta. 4. Immediately add pasta to the large bowl and toss with the butter vigorously. 5. Once butter is melted, add in grated parmigiano reggiano. Toss until combined using pasta water as needed to melt the cheese. Season with salt and pepper. 6. Serve in a bowl topped with additional parmigiano reggiano.",
      "cookingTime": "8-10 minutes"
    },
    {
      "title": "American Breakfast",
      "ingredients": [
        "eggs",
        "bacon",
        "toast",
        "pancakes",
        "hashbrowns"
      ],
      "method": "qwerty qwerty qwerty",
      "cookingTime": "10 minutes",
      "id": "tBcRlt4"
    },
    {
      "title": "Chicken Parm",
      "ingredients": [],
      "method": "qwerty qwerty qwerty",
      "cookingTime": "55 minutes",
      "id": "I4CNdCr"
    },
    {
      "title": "Nacho Fries",
      "ingredients": [
        "fries",
        "nacho cheese dip",
        "cheese power snow"
      ],
      "method": "asdf asdf asdf",
      "cookingTime": "25 minutes",
      "id": "hlK16cv"
    },
    {
      "title": "CopyCat KFC Original Chicken",
      "ingredients": [
        "2 cups all-purpose",
        "2/3 tablespoon salt",
        "1/2 tablespoon dried thyme leaves",
        "1/2 tablespoon dried basil leaves",
        "1/3 tablespoon dried oregano leaves",
        "1 tablespoon celery salt",
        "1 tablespoon ground black pepper",
        "1 tablespoon dried mustard",
        "3 tablespoons paprika (original recipe calls for 4 tablespoons)",
        "2 tablespoons garlic salt",
        "1 tablespoon ground ginger",
        "3 tablespoons ground white pepper",
        "2 teaspoons Accent Seasoning , optional (I left this out)",
        "1 cup buttermilk",
        "1 large egg",
        "1 chicken , cut into 10 pieces (2 wings, 2 legs, 2 thighs and 2 breasts each cut in half to make 4 breast pieces)",
        "peanut oil for frying"
      ],
      "method": "1. Add the spices to a small food processor until they're all uniform in size and the thyme, basil and oregano aren't larger in size anymore.\nAdd the flour in a bowl with all the herbs and spices and mix with a whisk.\nIn a second larger bowl add the buttermilk and egg together and whisk until combined.\nAdd the chicken to the buttermilk mixture for 20-30 minutes.\nRemove chicken from the buttermilk soak and let any excess buttermilk drip off.\nDredge the chicken pieces in the flour mixture on all sides, then shake off the excess coating.\nLet it rest on a cookie sheet for 20-30 minutes.\nAdd oil to a deep fryer or a large pot that is at least 5 inches high so that the chicken can be fully submerged.\nHeat the oil to 350 degrees and fry in small batches for 15-18 minutes.\nRemove the chicken from the oil and add to a drying rack on top of a clean cookie sheet.\nIf you add it to a paper towel or newspaper the bottom of the chicken will steam from the heat and become soft.",
      "cookingTime": "60 minutes",
      "id": "8GnJ2l7"
    },
    {
      "title": "CopyCat Raising Canes Recipe",
      "ingredients": [
        "Chicken Breast",
        "2 Cups Flour",
        "1 Cup Seasoned Bread Crumbs",
        "2 tsp Salt",
        "2 tsp Baking Powder",
        "2 Egg",
        "2 Cups Buttermilk",
        "1 Tbsp Garlic Powder",
        "Canes Sauce:",
        "1 Cup Mayonnaise",
        "⅔ Cup Ketchup",
        "1 Tbsp Worcestershire Sauce",
        "1 tsp Garlic Powder",
        "2 tsp Freshly Ground Black Pepper",
        "1 tsp Fresh Lemon Juice"
      ],
      "method": "1. Cut your thick juicy chicken breasts into strips (3 per breast plus the tenderloin)\n2. Whisk together 2 Eggs, 2 Cups Buttermilk & 1 Tbsp Garlic Powder and pour mixture along with chicken into a sealable container\n3. Refrigerate for 2-4 hours\n4. In a paper bag or the Batter Pro, combine 2 Cups Flour, 1 Cup Seasoned Bread Crumbs, 2 tsp Salt and 2 tsp Baking Powder\n5. Toss chicken into this mixture and shake\n6. Toss chicken back into the wet mixture it was marinading in\n7. Toss chicken back into the dry mixture and shake one last time, they should have a beautiful double coat\n8. Deep fry for 3-4 minutes at 350°F or until fully cooked on the inside",
      "cookingTime": "14 minutes",
      "id": "BoNCuGL"
    }
  ]
}